package _03_Operator;

public class bet {

	public static void main(String[] args) {
//		*비트연산자 	사용하는 방법 방법만 알아두기. 
//					램이 작았던 당시 빠른 연산을 위해서 사용한 방법. 지금은 거의 사용하지x)
//					
//		&연산자			
//		00000011 -> 3	
//	&	00001010 -> 10  
//		--------------
//		00000010 -> 2		위 아래를 비교 0&0=0 1&0=0 0&1=0 1&1=1
//		
//		|연산자 			
//		00000011 -> 3
//	|	00001010 -> 10	
//		--------------
//		00001011 -> 11		위 아래를 비교 0&0=0 0&1=1 1&1=1 1&0=1
		
//		<<연산자 
//		00001111 -> 15 
//	<<	00011110 -> 30 2배
//	<<	00111100 -> 60 2배	비트가 왼쪽으로 1칸씩 이동.
//		
//		>>연산자
//		00001111 -> 15 
//	>>	00000111 -> 7	
//	>>	00000011 ->	3		비트가 오른쪽으로 1칸씩 이동. 나머지 값은 버려진다.
	
	}

}
